// Зазначаємо та експортуємо функцію retriveLocalStorage, щоб її можна було використовувати в інших місцях. Вона приймає певну типізацію як дженерік <T> і приймає ключ key типу string. Ця функція допомагає діставати значення зі сховища браузера і перетворювати їх у потрібний тип.
export const retriveLocalStorage = <T>(key: string) => {

    const object = localStorage.getItem(key) || ''
    // Створюємо константу object, яка містить у собі дані за ключем key з локального сховища браузера. Відповідно цей key підставляється з того, що ми передаємо у функцію, а якщо його немає в сховищі — записуємо пустий рядок ''.

    if (!object) {
        return {} as T
    }
    // Включаємо перевірку умови: якщо нашого object немає (значення пусте), то ми повертаємо порожній об'єкт із переданою типізацією через 'as T'.

    const parse = JSON.parse(object)
    // Створюємо константу parse, в якій ми просто парсимо за допомогою JSON.parse нашу константу object, тобто те, що витягнули з local storage.

    return parse as T
    // Повертаємо розпарсені дані parse, які приведені до потрібної типізації 'as T', яку ми передали на початку.
}