// Імпортуємо компоненти Link (клієнтська навігація) та Outlet (слот для вкладених маршрутів) із react-router
import {Link, Outlet} from "react-router";

// Створюємо та експортуємо функціональний компонент лейаута Menu
export const Menu = () => {
    // Повертаємо TSX розмітку навігаційного меню та слоту сторінок
    return (
        // Батьківський контейнер div для навігаційного меню та контенту
        <div>
            {/* Тег невпорядкованого списку ul для групування посилань навігації */}
            <ul>
                {/* Пункт списку з посиланням на головну сторінку за адресою '/' */}
                <li><Link to='/'>Home</Link></li>
                {/* Пункт списку з переходом на сторінку користувачів за адресою '/users' */}
                <li><Link to='/users'>Users</Link></li>
                {/* Пункт списку з переходом на сторінку постів за адресою '/posts' */}
                <li><Link to='/posts'>Posts</Link></li>
                {/* Пункт списку з переходом на сторінку коментарів за адресою '/comments' */}
                <li><Link to='/comments'>Comments</Link></li>
                {/* Пункт списку з переходом на комплексний маршрут за адресою '/complex' */}
                <li><Link to='/complex'>Complex</Link></li>

                {/* Тег горизонтальної лінії hr для візуального розділення меню та контенту сторінки */}
                <hr/>

                {/* Спеціальний компонент Outlet для відображення компонента активного дочірнього маршруту */}
                <Outlet/>
            </ul>
        </div>
    );
};