import {Link} from "react-router-dom";
// Імпортуємо Link з react-router-dom, який дозволить нам при натисканні на текст переходити по адресній строці до потрібного елементу в маршрутизації.

export const Menu = () => {
// Експортуємо саме меню, щоб використовувати його в інших файлах.
    return (
        // Обов'язково зазначаємо return, тому що повертаємо контейнер div, всередині якого є список.
        <div>
            <ul>
                <li><Link to={'/'}>home</Link></li>
                {/* При натисканні на Home ми попадаємо на початкову сторінку '/'. */}

                <li><Link to={'/login'}>login</Link></li>
                {/* При натисканні на Login ми попадаємо на сторінку з логінацією. */}

                <li><Link to={'/auth/resources'}>resources</Link></li>
                {/* При натисканні на resources ми йдемо за адресою '/auth/resources' на сторінку з аутентифікацією, після якої отримуємо потрібний нам масив даних. */}
            </ul>
        </div>
    );
};