import {Outlet} from "react-router-dom";
// Імпортуємо Outlet з пакету react-router-dom — це спеціальне місце (слот), куди будуть підставлятися наші дочірні сторінки

import {Menu} from "../components/menu/Menu.tsx";
// Імпортуємо наш створений компонент Menu[cite: 1].

// Створюємо та експортуємо MainLayout — це наша головна сторінка-обгортка (шаблон), яка залишається незмінною при переході між маршрутами
export const MainLayout = () => {
    return (
        <>
            <Menu/>
            {/* Відображаємо меню навігації зверху сторінки. */}

            <hr/>
            {/* Малюємо звичайну горизонтальну лінію для розділення блоків. */}

            <Outlet/>
            {/* Вказуємо Outlet — саме сюди React Router буде підставляти потрібний дочірній маршрут залежно від шляху */}
        </>
    );
};